In [1]:
# Bismillah

In [2]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last':  ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreySchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [5]:
df

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@gmail.com
2   John      Doe       JohnDoe@gmail.com

In [6]:
df['full_name'] = df['first'] + " " + df['last']
# df['full_name'] creates a new empty column called, full_name, and the R.H.S of the equation set it equal to values.

In [7]:
df['full_name']

0    Corey Schafer
1         Jane Doe
2         John Doe
Name: full_name, dtype: object

In [8]:
df.drop(columns = ['first', 'last'])

                    email      full_name
0  CoreySchafer@gmail.com  Corey Schafer
1       JaneDoe@gmail.com       Jane Doe
2       JohnDoe@gmail.com       John Doe

In [9]:
df

   first     last                   email      full_name
0  Corey  Schafer  CoreySchafer@gmail.com  Corey Schafer
1   Jane      Doe       JaneDoe@gmail.com       Jane Doe
2   John      Doe       JohnDoe@gmail.com       John Doe

In [10]:
df.drop(columns = ['first', 'last'], inplace = True)

In [11]:
df

                    email      full_name
0  CoreySchafer@gmail.com  Corey Schafer
1       JaneDoe@gmail.com       Jane Doe
2       JohnDoe@gmail.com       John Doe

In [12]:
df['full_name'].str.split(' ') # returns the lists of first and last names.

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [13]:
df['full_name'].str.split(' ', expand = True) # expand = True creates two columns, 0 and 1, and put the first name in 
# one column and the last name in the next column.

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [14]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)
# df[['first', 'last']] creates two empty columns, first and last and set the column, first, equal to column, 0, and last
# equal to column, 1.
# All the above work pertained to columns. The following work relates to rows.

In [15]:
df

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe

In [16]:
df.append({},ignore_index = True) # will create a row, correctly indexed, and assigned NaN, missing values. {} is given
# since 1 positional argument is required.

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe
3                     NaN            NaN    NaN      NaN

In [17]:
df.append({'first': 'Tony'}, ignore_index = True) # rest of the values can be provided in the same manner in the new row.

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe
3                     NaN            NaN   Tony      NaN

In [18]:
people = {
    'first': ['Tony', 'Steve'],
    'last':  ['Stark', 'Rogers'],
    'email': ['TonyStark@gmail.com', 'SteveRogers@gmail.com']
}

In [19]:
df2 = pd.DataFrame(people)

In [20]:
df2

   first    last                  email
0   Tony   Stark    TonyStark@gmail.com
1  Steve  Rogers  SteveRogers@gmail.com

In [21]:
df

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe

In [22]:
df.append(df2, ignore_index = True)

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe
3     TonyStark@gmail.com            NaN   Tony    Stark
4   SteveRogers@gmail.com            NaN  Steve   Rogers

In [23]:
df # the change hasn't actually taken place yet.

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe

In [24]:
df = df.append(df2, ignore_index = True) # this will make the change happen as shown below.

In [25]:
df

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe
3     TonyStark@gmail.com            NaN   Tony    Stark
4   SteveRogers@gmail.com            NaN  Steve   Rogers

In [26]:
df.drop(index = 4, inplace = True) # to drop the row, we have to tell the row index position like this in ().

In [27]:
df

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
1       JaneDoe@gmail.com       Jane Doe   Jane      Doe
2       JohnDoe@gmail.com       John Doe   John      Doe
3     TonyStark@gmail.com            NaN   Tony    Stark

In [28]:
df.drop(index = [1, 2]) # first method to drop rows with particular values.

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
3     TonyStark@gmail.com            NaN   Tony    Stark

In [29]:
filt = df['last'] == 'Doe' # second method to drop rows with particular values.

In [30]:
filt

0    False
1     True
2     True
3    False
Name: last, dtype: bool

In [31]:
df[filt]

               email full_name first last
1  JaneDoe@gmail.com  Jane Doe  Jane  Doe
2  JohnDoe@gmail.com  John Doe  John  Doe

In [32]:
df.drop(index = df[filt].index) 
# df[filt] produces only those rows of data frame where the condition is True, that is, the last name is Doe. 
# df[filt].index produces the index of those rows of data frame where the condition is True, that is, the last name is 
# Doe. In this case, these indexes are 1 and 2. So the whole command ultimately becomes: df.drop(index = [1, 2]).
# Thus, the rows indexed 1 and 2 have been deleted.

                    email      full_name  first     last
0  CoreySchafer@gmail.com  Corey Schafer  Corey  Schafer
3     TonyStark@gmail.com            NaN   Tony    Stark